       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MESSAGE     PIC X(50) VALUE "Hello from COBOL running in CI pipeline".

       PROCEDURE DIVISION.
           DISPLAY WS-MESSAGE.
           STOP RUN.
